
/* Presented when a URL cannot be loaded because its scheme isn't understood */
"Don't know how to load URL %@" = "Không biết cách tải URL %@";

/* Presented when an HTTP URL cannot establish a connection with a particular host */
"Could not connect to host %@" = "Không thể kết nối với máy chủ %@";

/* Presented when a response from an HTTP server comes back with a bad format */
"Bad header received from server" = "Đã nhận tiêu đề không hợp lệ từ máy chủ";

/* Presented when a description of a particular host can't be determined. */
"Can't determine IP address of host: %@" = "Không thể xác định địa chỉ IP của máy chủ: %@";

/* Presented when the host description was found, but a particular port couldn't be opened. */
"Can't get a description of port %d" = "Không thể lấy mô tả cổng %d";

/* Presented when a particular host cannot be contacted via the given port */
"Can't connect to host %@ using port %d" = "Không thể kết nối với máy chủ %@ bằng cổng %d";

/* Presented when an HTTP server comes back with an unknown status code */
"Received unknown HTTP server response %@: %@" = "Đã nhận phản hồi máy chủ HTTP không xác định %@: %@";

/* Presented when an HTTP server returns a failure code */
"HTTP request failed for URL %@:%@" = "Yêu cầu HTTP không thành công cho URL %@:%@";

/* Presented when the connection to an HTTP server is unexpectedly lost */
"Lost connection to host %@" = "Mất kết nối với máy chủ %@";

/* Presented when a file can not be opened for reading (file may not exist) */
"Could not read from %@" = "Không thể đọc từ %@";

/* Presented when a redirection loop has been detected */
"Detected a redirection loop while attempting to load URL %@" = "Đã phát hiện vòng lặp chuyển hướng khi thử tải URL %@";

/* Presented when an FTP server hangs up or becomes otherwise unavailable */
"Service unavailable for host %@" = "Dịch vụ không khả dụng cho máy chủ %@";

/* Presented when the data transfer socket cannot be created for an FTP transfer */
"Couldn't open data connection for URL path: %@" = "Không thể mở kết nối dữ liệu cho đường dẫn URL: %@";

/* Presented when the indicated URL does not locate ane existing object on the server */
"Object not available for specified URL: %@" = "Đối tượng không khả dụng cho URL được chỉ định: %@";

/* Presented when the FTP server doesn't recognize a particular command */
"FTP command not recognized by host: %@" = "Máy chủ không nhận ra lệnh FTP: %@";

/* Presented when the FTP server rejects an authentication */
"User login or password not recognized." = "Không nhận ra đăng nhập người dùng hoặc mật khẩu.";

/* Format used to display sizes 100 GB or greater */
"%.0f GB" = "%.0f GB";

/* Format used to display sizes between 100 and 999 KB */
"%.0f KB" = "%.0f KB";

/* Format used to display sizes between 100 and 999 MB */
"%.0f MB" = "%.0f MB";

/* Format used to display a size between 2 and 100 bytes */
"%.0f bytes" = "%.0f byte";

/* Format used to display sizes between 1000 MB and 9.9 GB */
"%.1f GB (1.0)" = "%.1f GB";

/* Format used to display sizes between 10 and 99.9 GB */
"%.1f GB (10.0)" = "%.1f GB";

/* Format used to display sizes between 100 and 999 bytes */
"%.1f KB (0.1)" = "%.1f KB";

/* Format used to display sizes between 1000 bytes and 9.9 KB */
"%.1f KB (1.0)" = "%.1f KB";

/* Format used to display sizes between 10 and 99.9 KB */
"%.1f KB (10.0)" = "%.1f KB";

/* Format used to display sizes between 1000 KB and 9.9 MB */
"%.1f MB (1.0)" = "%.1f MB";

/* Format used to display sizes between 10 and 99.9 MB */
"%.1f MB (10.0)" = "%.1f MB";

/* Format string for label of a saved password in Keychain: URL (USERNAME) */
"%@ (%@)" = "%@ (%@)";

/* Format used to partial byte count along with total */
"%@ of %@" = "%@ trên %@";

/* String used for showing a zero byte size */
"0 bytes" = "0 byte";

/* String used for showing a one byte size */
"1 byte" = "1 byte";

/* Kind string used for keychain items from forms-based logins */
"Web form password" = "Mật khẩu mẫu web";

/* HTTP result code string */
"accepted" = "đã chấp nhận";

/* HTTP result code string */
"bad gateway" = "cổng kết nối không hợp lệ";

/* HTTP result code string */
"bad request" = "yêu cầu không hợp lệ";

/* HTTP result code string */
"client error" = "lỗi máy khách";

/* HTTP result code string */
"conflict" = "xung đột";

/* HTTP result code string */
"continue" = "tiếp tục";

/* HTTP result code string */
"created" = "đã tạo";

/* HTTP result code string */
"expectation failed" = "mong đợi không thành công";

/* HTTP result code string */
"forbidden" = "bị cấm";

/* HTTP result code string */
"found" = "đã tìm thấy";

/* HTTP result code string */
"gateway timed out" = "cổng kết nối hết thời gian chờ";

/* HTTP result code string */
"informational" = "có thông tin";

/* HTTP result code string */
"internal server error" = "lỗi máy chủ nội bộ";

/* HTTP result code string */
"length required" = "yêu cầu độ dài";

/* HTTP result code string */
"method not allowed" = "phương pháp không được phép";

/* HTTP result code string */
"moved permanently" = "di chuyển vĩnh viễn";

/* HTTP result code string */
"multiple choices" = "nhiều lựa chọn";

/* HTTP result code string */
"needs proxy" = "cần proxy";

/* HTTP result code string */
"no content" = "không có nội dung";

/* HTTP result code string */
"no error" = "không có lỗi";

/* HTTP result code string */
"no longer exists" = "không tồn tại nữa";

/* HTTP result code string */
"non-authoritative information" = "thông tin không chính thức";

/* HTTP result code string */
"not found" = "không tìm thấy";

/* HTTP result code string */
"not modified" = "không sửa đổi";

/* HTTP result code string */
"partial content" = "nội dung một phần";

/* HTTP result code string */
"payment required" = "yêu cầu thanh toán";

/* HTTP result code string */
"precondition failed" = "tiền đề không thành công";

/* HTTP result code string */
"proxy authentication required" = "yêu cầu xác thực proxy";

/* HTTP result code string */
"redirected" = "đã chuyển hướng";

/* HTTP result code string */
"request timed out" = "yêu cầu hết thời gian chờ";

/* HTTP result code string */
"request too large" = "yêu cầu quá lớn";

/* HTTP result code string */
"requested URL too long" = "URL được yêu cầu quá dài";

/* HTTP result code string */
"requested range not satisfiable" = "dải yêu cầu không thỏa mãn";

/* HTTP result code string */
"reset content" = "đặt lại nội dung";

/* HTTP result code string */
"see other" = "xem phần khác";

/* HTTP result code string */
"server error" = "lỗi máy chủ";

/* HTTP result code string */
"service unavailable" = "dịch vụ không khả dụng";

/* HTTP result code string */
"success" = "thành công";

/* HTTP result code string */
"switching protocols" = "chuyển giao thức";

/* HTTP result code string */
"temporarily redirected" = "tạm thời chuyển hướng";

/* HTTP result code string */
"unacceptable" = "không thể chấp nhận";

/* HTTP result code string */
"unauthorized" = "không được ủy quyền";

/* HTTP result code string */
"unimplemented" = "chưa thực hiện";

/* Unknown filename */
"unknown" = "không xác định";

/* HTTP result code string */
"unsupported media type" = "loại phương tiện không được hỗ trợ";

/* HTTP result code string */
"unsupported version" = "phiên bản không được hỗ trợ";
